app/Controllers/CRUD.php

    public function Vista_CRUD(){
        $UsuarioModel = new UsuarioModel();
        $data['usuario'] = $UsuarioModel->orderBy('id_usuarios')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuarios`

    public function singleUser($id_usuarios = null) {
        $UsuarioModel = new UsuarioModel();
        $data['user_obj'] = $UsuarioModel->where('id_usuarios', $id_usuarios)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuarios` = '1'
 LIMIT 1