app/Controllers/Perfil.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuarios` = '1'
---
    public function account()
    {
        // Obtener los datos del usuario a partir de la sesión
        $usuarioId = session('usuario')['id_usuarios'];
        $usuario = session('usuario')['usuario'];
        $nombre = session('usuario')['nombre'];
        $apellido = session('usuario')['apellido'];
        $telefono = session('usuario')['telefono'];
        $biografia = session('usuario')['biografia'];

        // Obtener el rol del usuario desde la base de datos
        $UsuarioModel = new UsuarioModel();
        $usuarioData = $UsuarioModel->find($usuarioId);

SELECT *
FROM `usuarios`
WHERE `usuario` = '28132505liz'
 LIMIT 1
---
    public function public($usuario)
    {
        // Obtener la información del usuario correspondiente de la base de datos
        $UsuarioModel = new UsuarioModel();
        $usuario = $UsuarioModel->where('usuario', $usuario)->first();