app/Controllers/Publicar.php

SELECT *
FROM `publicaciones`
WHERE `id_categorias` = '1'
SELECT *
FROM `publicaciones`
---
    public function Principal($categoriaId = null)
{
    $publicacionesModel = new PublicacionesModel();

    if ($categoriaId !== null) {
        $publicaciones = $publicacionesModel->where('id_categorias', $categoriaId)->findAll();
    } else {
        $publicaciones = $publicacionesModel->findAll();