app/Controllers/sesion.php

INSERT INTO `perfiles` (`id_usuarios`) VALUES (14)
---

                // Crear un registro en la tabla 'perfiles' relacionado con el usuario
                $PerfilModel = new PerfilesModel();
                $PerfilModel->insert(array('id_usuarios' => $id_usuario));