app/Controllers/sesion.php

            ];

            $UsuarioModel = new UsuarioModel();
            $query = $UsuarioModel->insert($data);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `cedula`, `usuario`, `password`, `telefono`, `biografia`, `roles`) VALUES ('saul', 'sequera', '46447447', '46447447saul', '$2y$10$thmORdrTrdvvy6NR78Ho9uVqfzQLEVek0VBLdLZcjkY/V8./yhRJK', '45612378989', '', 0)

    public function login(){

        $Usuario = new UsuarioModel();
        $usuario = $this->request->getPost('usuario');
        $password = $this->request->getPost('password');

        $datosUsuario = $Usuario->where(['usuario' => $usuario])->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = '28132505liz'
 LIMIT 1